{
  "NavBar": {
    "home": "Home",
    "skills": "Skills",
    "projects": "Projects",
    "contact": "Contact"
  },
  "HomePage": {
    "title": "Hello 👋, I'm Guilherme Duarte",
    "sub-title": "Full-Stack Developer",
    "summary": "Full-stack developer with a passion for programming and a strong foundation in modern technologies.\nMy journey includes studies in Science and Technology at UFERSA, and I am currently pursuing a degree in Systems Analysis and Development at UNINTER, complemented by intensive full-stack web development training programs such as SharpCoders and the Desenvolve program.\nI have hands-on experience with a wide range of technologies, including HTML5, CSS3, JavaScript, React, Angular, Node.js, .NET, and Docker, as well as deploying on AWS.\nMy focus on personal projects like 'Controle Certo' and 'Apollo Coders' has allowed me to develop skills in team leadership, agile methodologies, and GitHub collaboration, while also enhancing my knowledge in system integration and REST APIs.\nI am self-taught and always seeking new challenges. I enjoy adapting to different environments and teams and am willing to learn any technology that enables me to contribute even more. With strong motivation to solve complex problems, I am looking for opportunities to contribute to both front-end and back-end development, focusing on delivering efficient and well-constructed solutions."
  },
  "contact": {
    "title": "Contact Me",
    "submit": "Send Message"
  },
  "skills": {
    "title": "Skills",
    "timeline": {
      "title": "Timeline",
      "ads": {
        "title": "Systems Analysis and Development - UNINTER",
        "type": "Education",
        "period": "06/2023 - currently",
        "description": "The Systems Analysis and Development (ADS) course, offered in the distance learning modality by UNINTER, equips students with the skills and knowledge necessary to understand the design, construction, and maintenance of software. The program covers various stages of development, including system requirements gathering, translating this information into structured documentation, development planning, programming, deployment, and long-term software maintenance. With a comprehensive education, the ADS course prepares professionals to work in any or all phases of software development, enabling them to stand out in an ever-evolving market. Graduates are ready to face a variety of challenges, significantly contributing to multidisciplinary teams and diverse projects."
      },
      "csj": {
        "title": "Technical Support Analyst at CSJ SYSTEMS",
        "type": "Experience",
        "period": "01/2022 - currently",
        "description": "Customer support in a SAAS system. Requires practical knowledge of the platform, which can be summarized as an ERP or POS."
      },
      "ufersa": {
        "title": "Bachelor's in Science and Technology (BCT) - UFERSA",
        "type": "Education",
        "period": "06/2018 - incomplete",
        "description": "The Bachelor's in Science and Technology prepares professionals for specialization in various engineering fields, such as civil, mechanical, and electrical. During this course, I noticed my growing interest in programming. Due to this passion and the intensity with which I began to dedicate myself to this new field, I decided to pause the course and focus my efforts on developing programming skills and knowledge."
      }
    }
  },
  "projects": {
    "title": "Projects",
    "view-project": "View Project",
    "campoMinado": {
      "name": "Minesweeper",
      "description": "Minesweeper is a very interesting game, both to play and to develop. We often don't see the use of recursion in functions, but it plays an important role in simplifying and easing the code of a game like this. Made with just JavaScript, HTML, and CSS in 2021."
    },
    "xadrez": {
      "name": "Chess",
      "description": "To put the study of the HTML Drag and Drop API into practice, I developed this chess game project that uses DnD to move pieces. It is not complete (has some bugs) but was a satisfactory project for its intended purposes."
    },
    "jogoDosNumeros": {
      "name": "Number Game",
      "description": "I don't know what to call this game, I called it Number Game. It was a very fun project to make using React. Anyone who has tried to implement drag or mousemove events in React knows how complicated it is, so my goal was to make piece movement work as simply as possible using \"Drag'n'Drop with mouse events\"."
    },
    "controleCerto": {
      "name": "Controle Certo",
      "description": "Controle Certo is an expense and revenue management application. The goal of this site is to allow users to better control their expenses, improving their financial health. The differential of Controle Certo is its friendly and easy-to-understand interface. This site allows you to register your accounts, cards, and separate your income and expenses into categories, also allowing you to control the bills of the registered cards."
    },
    "kanbanboard": {
      "name": "Kanban Board",
      "description": "This project was developed based on Trello. It is a website where you can create cards with items inside each card, and it is possible to drag these items between them or between different cards. This project was developed using only HTML, CSS, and pure JavaScript, leveraging only the features provided by the browser APIs."
    },
    "esportreact": {
      "name": "Esport Tournament",
      "description": "Landing page project for e-sport tournament registration, developed during an internship. The development used TypeScript, React, Styled-Components, Context API (React), and Custom Hooks (React)."
    },
    "apollocoders": {
      "name": "Apollo Coders",
      "description": "Apollo Coders is the name given to our team during the Angular/.NET 'Sharp Coders' Bootcamp, where I participated as the team leader of a group of 12 people. We designed a landing page and also a prototype of a digital bank using Figma (for design), Angular, Bootstrap, .NET, JWT, etc. As the leader, I was responsible for defining the project and managing the team."
    },
    "guiaplus": {
      "name": "Guia Plus",
      "description": "The Guia+ system is a web application that will be made available to any qualified transporter, allowing them to register clients, manage waybills, start collections, and confirm pickups. The project was developed within 2 days using Vite, React, Leaflet, Axios, React Hook Form, React Router DOM, and Material UI."
    }
  }
}