{
  "NavBar": {
    "home": "Início",
    "skills": "Habilidades",
    "projects": "Projetos",
    "contact": "Contato"
  },
  "HomePage": {
    "title": "Olá 👋, eu sou o Guilherme Duarte",
    "sub-title": "Desenvolvedor Full-Stack",
    "summary": "Desenvolvedor full-stack com uma paixão por programação e uma forte base em tecnologias modernas. \nMinha trajetória inclui estudos em Ciência e Tecnologia pela UFERSA e atualmente curso Análise e Desenvolvimento de Sistemas pela UNINTER, complementados por programas intensivos de formação em desenvolvimento web full-stack, como o SharpCoders e o programa Desenvolve. \nTenho experiência prática em uma ampla gama de tecnologias, incluindo HTML5, CSS3, JavaScript, React, Angular, Node.js, .NET e Docker, além de deploys em AWS. \nMeu foco em projetos pessoais, como o 'Controle Certo' e 'Apollo Coders', me permitiu desenvolver habilidades em liderança de equipes, uso de metodologias ágeis e colaboração por GitHub, além de aprimorar meus conhecimentos em integração de sistemas e API REST. \nSou autodidata e estou sempre em busca de novos desafios. Gosto de me adaptar a diferentes ambientes e equipes, e estou disposto a aprender qualquer tecnologia que me permita contribuir mais ainda. Com uma forte motivação para solucionar problemas complexos, busco oportunidades para contribuir tanto no front-end quanto no back-end, com foco na entrega de soluções eficientes e bem construídas."
  },
  "contact": {
    "title": "Me contate",
    "submit": "Enviar Mensagem"
  },
  "skills": {
    "title": "Habilidades",
    "timeline": {
      "title": "Timeline",
      "ads": {
        "title": "Análise e Desenvolvimento de Sistemas - UNINTER",
        "type": "Educação",
        "period": "06/2023 - atualmente",
        "description": "O curso de Análise e Desenvolvimento de Sistemas (ADS) na modalidade EAD oferecido pela UNINTER capacita os alunos a adquirir as habilidades e conhecimentos necessários para compreender a projeção, construção e manutenção de software. O programa abrange diversas etapas do desenvolvimento, incluindo a coleta de requisitos do sistema, a tradução dessas informações em documentação estruturada, o planejamento do desenvolvimento, a programação, o deploy e a manutenção a longo prazo do software. Com uma formação abrangente, o curso de ADS prepara o profissional para atuar em qualquer uma ou em todas as fases do desenvolvimento de software, permitindo que ele se destaque em um mercado em constante evolução. Os graduados saem aptos a enfrentar desafios variados, contribuindo de maneira significativa em equipes multidisciplinares e em projetos diversos."
      },
      "csj": {
        "title": "Analista de Suporte Tecnico na CSJ SISTEMAS",
        "type": "Experiência",
        "period": "01/2022 - atualmente",
        "description": "Suporte ao cliente em sistema SAAS. Requer conhecimentos práticos sobre a plataforma que pode se resumir a um ERP ou POS."
      },
      "ufersa": {
        "title": "Bacharelado em Ciências e Tecnologias (BCT) - UFERSA",
        "type": "Educação",
        "period": "06/2018 - incompleto",
        "description": "O bacharelado em Ciências e Tecnologias prepara o profissional para a especialização em diversas áreas da engenharia, como civil, mecânica e elétrica. Durante esse curso, percebi meu crescente interesse por programação. Em virtude dessa paixão e da intensidade com que comecei a me dedicar a essa nova área, decidi trancar o curso e concentrar meus esforços no desenvolvimento de habilidades e conhecimentos em programação."
      }
    }
  },
  "projects": {
    "title": "Projetos",
    "view-project": "Ver Projeto",
    "campoMinado": {
      "name": "Campo Minado",
      "description": "Campo minado é um jogo muito interessante, tanto para jogar quanto para desenvolver. Geralmente não enxergamos o uso de recursividade no uso de funções, mas isso tem um papel muito importante para simplificar e facilitar o código que um jogo como esse. Feito apenas com Javascript, HTML e CSS, em 2021."
    },
    "xadrez": {
      "name": "Xadrez",
      "description": "De forma a colocar em prática o estudo da API Drag and Drop do HTML, desenvolvi esse projeto de um jogo de xadrez que usa o DnD para movimentar as peças. Ele não está completo (apresenta alguns bugs) mas foi um projeto satisfatório para os fins propostos."
    },
    "jogoDosNumeros": {
      "name": "Jogo dos Números",
      "description": "Não sei dizer qual o nome desse jogo, chamei de Jogo dos Números, foi um projeto muito divertido de se fazer, usando React. Quem já tentou fazer esse tipo de evento de drag ou mousemove no React sabe o quanto é complicado de fazer, então o meu objetivo foi fazer funcionar da forma mais simples possível essa movimentação de peça usando conceitos de \"Drag'n'Drop com mouse events\"."
    },
    "controleCerto": {
      "name": "Controle Certo",
      "description": "Controle Certo é um aplicativo de gerenciamento de despesas e receitas. O objetivo desse site é permitir um controle maior dos gastos do usuário, a fim de melhorar a saúde financeira dele. O diferencial do Controle Certo é sua interface amigável e de fácil compreensão. Nesse site, é possível registrar suas contas, cartões e separar suas receitas e despesas por categorias, sendo possível também ter um controle das faturas dos cartões cadastrados."
    }
  }
}